# GetAddInId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterId..::..GetAddInId Method
UpdaterId Class See Also
---
AddInId of the UpdaterId
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AddInId GetAddInId()
```

Visual Basic
---
```text
Public Function GetAddInId As AddInId
```

Visual C++
---
```text
public:
AddInId^ GetAddInId()
```

# See Also
UpdaterId Class
Autodesk.Revit.DB Namespace